integration/src/Catalogs/грНастройкиПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>грНастройкиПоУмолчанию</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

integration/src/Catalogs/грНастройкиПоУмолчанию/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Описание = Справочники.грНастройкиПоУмолчанию.ПолучитьОписаниеНастройки(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.Описание.Видимость = ЗначениеЗаполнено(Описание)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначениеСпискомПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.ПомещениеПоставщика") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("грЛогическийСклад",ПредопределенноеЗначение("Перечисление.грЛогическиеСклады.СкладПоставщика"));
		
		ПараметрыСкладов = Новый Структура("Отбор");
		ПараметрыСкладов.Отбор = Отбор;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСкладаЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.Склады.Форма.ФормаВыбора", ПараметрыСкладов, ЭтотОбъект,,,,ОписаниеОповещения);
	//+++ GRADUM, Теплоухов А.В. 2021_10_05 Задача № ERP-1398{
	//ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.ПомещениеПолучательРО") Тогда
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.ПомещениеПолучательРО")
		Или Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.ПомещениеПоставщикаОклейкаУПоставщика")
		Или Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.ЗагрузкаЗПИзExcelПомещениеПоставщика")
		Тогда
	//--- GRADUM, Теплоухов А.В. 2021_10_05 Задача № ERP-1398}
		
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСкладаЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.Склады.Форма.ФормаВыбора",, ЭтотОбъект,,,, ОписаниеОповещения);
		
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.ЗагрузкаЗПИзExcelБанковскийСчет") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборБанковскогоСчетаЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.Организации.Форма.ФормаВыбора",, ЭтотОбъект,,,, ОписаниеОповещения);
		
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.грНастройкиПоУмолчанию.АкцияДляПрограммыЛояльности") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);
		
		ОткрытьФорму("Справочник.СкидкиНаценки.ФормаВыбораГруппы", ПараметрыФормы, Элемент, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОповещенияФормы

&НаКлиенте
Процедура ВыборСкладаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Склады") Тогда
		
		ПараметрыФормы = Новый Структура("Отбор");
		Отбор = Новый Структура;
		Отбор.Вставить("Владелец",Результат);
		ПараметрыФормы.Отбор = Отбор;
		ОткрытьФорму("Справочник.СкладскиеПомещения.Форма.ФормаВыбора", ПараметрыФормы, Элементы.Значение,,,);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборБанковскогоСчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Организации") Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Владелец",Результат);
		
		ПараметрыФормы = Новый Структура("Отбор");
		ПараметрыФормы.Отбор = Отбор;
		
		ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.Форма.ФормаВыбора", ПараметрыФормы, Элементы.Значение,,,);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Элементы.Значение.Видимость = НЕ Объект.ЗначениеСписком;
	Элементы.Значения.Видимость = Объект.ЗначениеСписком;
		
КонецПроцедуры

#КонецОбласти  //СлужебныеПроцедурыИФункции
